# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Binaries
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'git' # Latest Git version
brew 'httpie' # CLI HTTP client
brew 'mackup' # Backup application specific configuration
brew 'mas' # Mac App Store manager
brew 'trash' # Manage the Trash bin
brew 'tree' # List directories in a tree structure

# Development
brew 'gh' # GitHub CLI
brew 'composer'
brew 'node'
brew 'yarn'

# Apps
cask '1password'
cask '1password-cli'
cask 'appcleaner'
cask 'discord'
cask 'docker'
cask 'brave-browser'
cask 'iterm2'
cask 'spotify'
cask 'tableplus'
cask 'the-unarchiver'
cask 'visual-studio-code'
cask 'whatsapp'
cask 'notion'

# Mac App Store
mas 'Bear', id: 1091189122
mas 'Medis 2 - GUI for Redis', id: 1579200037
mas 'Hidden Bar', id: 1452453066
